HardSoft/obj/Release/Package/PackageTmp/xml/FECAESolicitar.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ar="http://ar.gov.afip.dif.FEV1/">
  <soapenv:Header/>
  <soapenv:Body>
    <ar:FECAESolicitar>
      <ar:Auth>
        <ar:Token>sa</ar:Token>
        <ar:Sign>dssdsad</ar:Sign>
        <ar:Cuit></ar:Cuit>
      </ar:Auth>
      <ar:FeCAEReq>
        <ar:FeCabReq>
          <ar:CantReg></ar:CantReg>
          <ar:PtoVta></ar:PtoVta>
          <ar:CbteTipo></ar:CbteTipo>
        </ar:FeCabReq>
        <ar:FeDetReq>
          <ar:FECAEDetRequest>
            <ar:Concepto></ar:Concepto>
            <ar:DocTipo></ar:DocTipo>
            <ar:DocNro></ar:DocNro>
            <ar:CbteDesde></ar:CbteDesde>
            <ar:CbteHasta></ar:CbteHasta>
            <ar:CbteFch></ar:CbteFch>
            <ar:ImpTotal></ar:ImpTotal>
            <ar:ImpTotConc></ar:ImpTotConc>
            <ar:ImpNeto></ar:ImpNeto>
            <ar:ImpOpEx></ar:ImpOpEx>
            <ar:ImpTrib></ar:ImpTrib>
            <ar:ImpIVA></ar:ImpIVA>
            <ar:FchServDesde></ar:FchServDesde>
            <ar:FchServHasta></ar:FchServHasta>
            <ar:FchVtoPago></ar:FchVtoPago>
            <ar:MonId></ar:MonId>
            <ar:MonCotiz></ar:MonCotiz>
            <ar:CbtesAsoc>
              <ar:CbteAsoc>
                <ar:Tipo></ar:Tipo>
                <ar:PtoVta></ar:PtoVta>
                <ar:Nro></ar:Nro>
              </ar:CbteAsoc>
            </ar:CbtesAsoc>
            <ar:Tributos>
              <ar:Tributo>
                <ar:Id></ar:Id>
                <ar:Desc></ar:Desc>
                <ar:BaseImp></ar:BaseImp>
                <ar:Alic></ar:Alic>
                <ar:Importe></ar:Importe>
              </ar:Tributo>
            </ar:Tributos>
            <ar:Iva>
              <ar:AlicIva>
                <ar:Id></ar:Id>
                <ar:BaseImp></ar:BaseImp>
                <ar:Importe></ar:Importe>
              </ar:AlicIva>
            </ar:Iva>
            <ar:Opcionales>
              <ar:Opcional>
                <ar:Id></ar:Id>
                <ar:Valor></ar:Valor>
              </ar:Opcional>
            </ar:Opcionales>
          </ar:FECAEDetRequest>
        </ar:FeDetReq>
      </ar:FeCAEReq>
    </ar:FECAESolicitar>
  </soapenv:Body>
</soapenv:Envelope>